{
  "posts": [
    {
      "id": "1",
      "title": "About Me",
      "body": "I am a current student at Calvin University studying Computer Science with a minor in German Studies. I love to program and learn about the inner workings of systems, and am interested in working in information security or development when I graduate.",
      "type": "text"
    },
    {
      "id": "2",
      "title": "Experience",
      "body": "I currently work at Calvin's Hekman Library as a Junior Systems Admin. I have previously worked at Trailhead Networks as a Helpdesk Technician and at Calvin Information Technology as a Helpdesk Technician. I am interested in internship opportunities in the fields of Computer Science and Cyber Security. ",
      "type": "text"
    },
     {
      "id": "3",
      "title": "What I'm Currently Learning",
      "body": "Im currently learning rust, WASM, and WebGL to try to simulate the conditions of hurricane sandy in 2012.",
      "type": "text"
    },
    {
      "id": "4",
      "title": "What enjoy programming in",
      "body": "My favorite languages are Rust, JavaScript, and C. I also don't mind Perl and Python.  ",
      "type": "text"
    },
    {
      "id": "5",
      "title": "Where to Find Me",
      "body": "You can find me on:",
      "list": [
        { "text": "https://github.com/elilewis327", "type": "link", "id": "0" },
        { "text": "mailto://elilewis327@gmail.com", "type": "link", "id": "1" },
        {
          "text": "https://www.linkedin.com/in/elilewis327/",
          "type": "link",
          "id": "2"
        },
        {
          "text": "https://www.glassdoor.com/member/profile/index.htm",
          "type": "link",
          "id": "3"
        }
      ],
      "type": "list"
    },
    {
      "id": "6",
      "title": "Projects",
      "body": "This is a short list of a couple of my projects: (These and others can be found on my github)",
      "list": [
        {
          "text": "Shell program written in C",
          "type": "text",
          "id": "0"
        },
        {
          "text": "This website, written in React and styled with Tailwind Css",
          "type": "text",
          "id": "1"
        },
        {
          "text": "Dark mode everywhere, a chrome extension for making non dark mode websites darker",
          "type": "text",
          "id": "2"
        },
        {
          "text": "ESP2866 LCD writer, a micropython firmware for a custom circuit board I built and had printed",
          "type": "text",
          "id": "3"
        }
      ],
      "type": "list"
    }
  ]
}
